
```
15> shell:start().
<0.53.0>
Eshell V5.9.3  (abort with ^G)
1> shell:start().
<0.57.0>
Eshell V5.9.3  (abort with ^G)

1> exit(foo).
** exception exit: foo
2> exit(foo).
** exception exit: foo
```
